<details>
      <summary>📋 Terraform Plan Output (Part 1/3)</summary>
      
      ```
      
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # random_password.db_password will be created
  + resource "random_password" "db_password" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 16
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = true
      + upper       = true
    }

  # random_password.jwt_secret will be created
  + resource "random_password" "jwt_secret" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 64
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = false
      + upper       = true
    }

  # random_string.suffix will be created
  + resource "random_string" "suffix" {
      + id          = (known after apply)
      + length      = 8
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

  # module.alb.aws_lb.main will be created
  + resource "aws_lb" "main" {
      + arn                                                          = (known after apply)
      + arn_suffix                                                   = (known after apply)
      + client_keep_alive                                            = 3600
      + desync_mitigation_mode                                       = "defensive"
      + dns_name                                                     = (known after apply)
      + drop_invalid_header_fields                                   = false
      + enable_deletion_protection                                   = false
      + enable_http2                                                 = true
      + enable_tls_version_and_cipher_suite_headers                  = false
      + enable_waf_fail_open                                         = false
      + enable_xff_client_port                                       = false
      + enable_zonal_shift                                           = false
      + enforce_security_group_inbound_rules_on_private_link_traffic = (known after apply)
      + id                                                           = (known after apply)
      + idle_timeout                                                 = 60
      + internal                                                     = false
      + ip_address_type                                              = (known after apply)
      + load_balancer_type                                           = "application"
      + name                                                         = "leafwheels-alb"
      + name_prefix                                                  = (known after apply)
      + preserve_host_header                                         = false
      + security_groups                                              = (known after apply)
      + subnets                                                      = (known after apply)
      + tags                                                         = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "leafwheels-alb"
          + "Project"     = "LeafWheels"
        }
      + tags_all                                                     = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "leafwheels-alb"
          + "Project"     = "LeafWheels"
        }
      + vpc_id                                                       = (known after apply)
      + xff_header_processing_mode                                   = "append"
      + zone_id                                                      = (known after apply)

      + subnet_mapping {
          + allocation_id        = (known after apply)
          + ipv6_address         = (known after apply)
          + outpost_id           = (known after apply)
          + private_ipv4_address = (known after apply)
          + subnet_id            = (known after apply)
        }
    }

  # module.alb.aws_lb_listener.http will be created
  + resource "aws_lb_listener" "http" {
      + arn                                                                   = (known after apply)
      + id                                                                    = (known after apply)
      + load_balancer_arn                                                     = (known after apply)
      + port                                                                  = 80
      + protocol                                                              = "HTTP"
      + routing_http_request_x_amzn_mtls_clientcert_header_name               = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_issuer_header_name        = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_leaf_header_name          = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_serial_number_header_name = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_subject_header_name       = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_validity_header_name      = (known after apply)
      + routing_http_request_x_amzn_tls_cipher_suite_header_name              = (known after apply)
      + routing_http_request_x_amzn_tls_version_header_name                   = (known after apply)
      + routing_http_response_access_control_allow_credentials_header_value   = (known after apply)
      + routing_http_response_access_control_allow_headers_header_value       = (known after apply)
      + routing_http_response_access_control_allow_methods_header_value       = (known after apply)
      + routing_http_response_access_control_allow_origin_header_value        = (known after apply)
      + routing_http_response_access_control_expose_headers_header_value      = (known after apply)
      + routing_http_response_access_control_max_age_header_value             = (known after apply)
      + routing_http_response_content_security_policy_header_value            = (known after apply)
      + routing_http_response_server_enabled                                  = (known after apply)
      + routing_http_response_strict_transport_security_header_value          = (known after apply)
      + routing_http_response_x_content_type_options_header_value             = (known after apply)
      + routing_http_response_x_frame_options_header_value                    = (known after apply)
      + ssl_policy                                                            = (known after apply)
      + tags_all                                                              = (known after apply)
      + tcp_idle_timeout_seconds                                              = (known after apply)

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }

      + mutual_authentication {
          + advertise_trust_store_ca_names   = (known after apply)
          + ignore_client_certificate_expiry = (known after apply)
          + mode                             = (known after apply)
          + trust_store_arn                  = (known after apply)
        }
    }

  # module.alb.aws_lb_listener_rule.actuator will be created
  + resource "aws_lb_listener_rule" "actuator" {
      + arn          = (known after apply)
      + id           = (known after apply)
      + listener_arn = (known after apply)
      + priority     = 200
      + tags_all     = (known after apply)

      + action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }

      + condition {

          + path_pattern {
              + values = [
                  + "/actuator/*",
                ]
            }
        }
    }

  # module.alb.aws_lb_listener_rule.api will be created
  + resource "aws_lb_listener_rule" "api" {
      + arn          = (known after apply)
      + id           = (known after apply)
      + listener_arn = (known after apply)
      + priority     = 100
      + tags_all     = (known after apply)

      + action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }

      + condition {

          + path_pattern {
              + values = [
                  + "/api/*",
                ]
            }
        }
    }

  # module.alb.aws_lb_listener_rule.grafana will be created
  + resource "aws_lb_listener_rule" "grafana" {
      + arn          = (known after apply)
      + id           = (known after apply)
      + listener_arn = (known after apply)
      + priority     = 300
      + tags_all     = (known after apply)

      + action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }

      + condition {

          + path_pattern {
              + values = [
                  + "/grafana",
                  + "/grafana/*",
                ]
            }
        }
    }

  # module.alb.aws_lb_listener_rule.prometheus will be created
  + resource "aws_lb_listener_rule" "prometheus" {
      + arn          = (known after apply)
      + id           = (known after apply)
      + listener_arn = (known after apply)
      + priority     = 400
      + tags_all     = (known after apply)

      + action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }

      + condition {

          + path_pattern {
              + values = [
                  + "/prometheus",
                  + "/prometheus/*",
                ]
            }
        }
    }

  # module.alb.aws_lb_target_group.backend will be created
  + resource "aws_lb_target_group" "backend" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = (known after apply)
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancer_arns                 = (known after apply)
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_anomaly_mitigation  = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "leafwheels-backend-tg"
      + name_prefix                        = (known after apply)
      + port                               = 8080
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags                               = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "leafwheels-backend-tg"
          + "Project"     = "LeafWheels"
        }
      + tags_all                           = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "leafwheels-backend-tg"
          + "Project"     = "LeafWheels"
        }
      + target_type                        = "ip"
      + vpc_id                             = (known after apply)

      + health_check {
          + enabled             = true
          + healthy_threshold   = 2
          + interval            = 45
          + matcher             = "200"
          + path                = "/actuator/health"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = 10
          + unhealthy_threshold = 3
        }

      + stickiness {
          + cookie_duration = (known after apply)
          + cookie_name     = (known after apply)
          + enabled         = (known after apply)
          + type            = (known after apply)
        }

      + target_failover {
          + on_deregistration = (known after apply)
          + on_unhealthy      = (known after apply)
        }

      + target_group_health {
          + dns_failover {
              + minimum_healthy_targets_count      = (known after apply)
              + minimum_healthy_targets_percentage = (known after apply)
            }

          + unhealthy_state_routing {
              + minimum_healthy_targets_count      = (known after apply)
              + minimum_healthy_targets_percentage = (known after apply)
            }
        }

      + target_health_state {
          + enable_unhealthy_connection_termination = (known after apply)
          + unhealthy_draining_interval             = (known after apply)
        }
    }

  # module.alb.aws_lb_target_group.frontend will be created
  + resource "aws_lb_target_group" "frontend" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = (known after apply)
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancer_arns                 = (known after apply)
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_anomaly_mitigation  = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "leafwheels-frontend-tg"
      + name_prefix                        = (known after apply)
      + port                               = 3000
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags                               = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "leafwheels-frontend-tg"
          + "Project"     = "LeafWheels"
        }
      + tags_all                           = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "leafwheels-frontend-tg"
          + "Project"     = "LeafWheels"
        }
      + target_type                        = "ip"
      + vpc_id                             = (known after apply)

      + health_check {
          + enabled             = true
          + healthy_threshold   = 2
          + interval            = 30
          + matcher             = "200"
          + path                = "/"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = 5
          + unhealthy_threshold = 2
        }

      + stickiness {
          + cookie_duration = (known after apply)
          + cookie_name     = (known after apply)
          + enabled         = (known after apply)
          + type            = (known after apply)
        }

      + target_failover {
          + on_deregistration = (known after apply)
          + on_unhealthy      = (known after apply)
        }

      + target_group_health {
          + dns_failover {
              + minimum_healthy_targets_count      = (known after apply)
              + minimum_healthy_targets_percentage = (known after apply)
            }

          + unhealthy_state_routing {
              + minimum_healthy_targets_count      = (known after apply)
              + minimum_healthy_targets_percentage = (known after apply)
            }
        }

      + target_health_state {
          + enable_unhealthy_connection_termination = (known after apply)
          + unhealthy_draining_interval             = (known after apply)
        }
    }

  # module.alb.aws_lb_target_group.grafana will be created
  + resource "aws_lb_target_group" "grafana" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = (known after apply)
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancer_arns                 = (known after apply)
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_anomaly_mitigation  = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "leafwheels-grafana-tg"
      + name_prefix                        = (known after apply)
      + port                               = 3000
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags                               = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "leafwheels-grafana-tg"
          + "Project"     = "LeafWheels"
        }
      + tags_all                           = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "leafwheels-grafana-tg"
          + "Project"     = "LeafWheels"
        }
      + target_type                        = "ip"
      + vpc_id                             = (known after apply)

      + health_check {
          + enabled             = true
          + healthy_threshold   = 2
          + interval            = 45
          + matcher             = "200"
          + path                = "/api/health"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = 10
          + unhealthy_threshold = 3
        }

      + stickiness {
          + cookie_duration = (known after apply)
          + cookie_name     = (known after apply)
          + enabled         = (known after apply)
          + type            = (known after apply)
        }

      + target_failover {
          + on_deregistration = (known after apply)
          + on_unhealthy      = (known after apply)
        }

      + target_group_health {
          + dns_failover {
              + minimum_healthy_targets_count      = (known after apply)
              + minimum_healthy_targets_percentage = (known after apply)
            }

          + unhealthy_state_routing {
              + minimum_healthy_targets_count      = (known after apply)
              + minimum_healthy_targets_percentage = (known after apply)
            }
        }

      + target_health_state {
          + enable_unhealthy_connection_termination = (known after apply)
          + unhealthy_draining_interval             = (known after apply)
        }
    }

  # module.alb.aws_lb_target_group.prometheus will be created
  + resource "aws_lb_target_group" "prometheus" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = (known after apply)
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancer_arns                 = (known after apply)
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_anomaly_mitigation  = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "leafwheels-prometheus-tg"
      + name_prefix                        = (known after apply)
      + port                               = 9090
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags                               = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "leafwheels-prometheus-tg"
          + "Project"     = "LeafWheels"
        }
      + tags_all                           = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "leafwheels-prometheus-tg"
          + "Project"     = "LeafWheels"
        }
      + target_type                        = "ip"
      + vpc_id                             = (known after apply)

      + health_check {
          + enabled             = true
          + healthy_threshold   = 2
          + interval            = 45
          + matcher             = "200"
          + path                = "/prometheus/-/healthy"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = 10
          + unhealthy_threshold = 3
        }

      + stickiness {
          + cookie_duration = (known after apply)
          + cookie_name     = (known after apply)
          + enabled         = (known after apply)
          + type            = (known after apply)
        }

      + target_failover {
          + on_deregistration = (known after apply)
          + on_unhealthy      = (known after apply)
        }

      + target_group_health {
          + dns_failover {
              + minimum_healthy_targets_count      = (known after apply)
              + minimum_healthy_targets_percentage = (known after apply)
            }

          + unhealthy_state_routing {
              + minimum_healthy_targets_count      = (known after apply)
              + minimum_healthy_targets_percentage = (known after apply)
            }
        }

      + target_health_state {
          + enable_unhealthy_connection_termination = (known after apply)
          + unhealthy_draining_interval             = (known after apply)
        }
    }

  # module.ecr.aws_ecr_lifecycle_policy.backend will be created
  + resource "aws_ecr_lifecycle_policy" "backend" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Keep last 10 images"
                      + rulePriority = 1
                      + selection    = {
                          + countNumber   = 10
                          + countType     = "imageCountMoreThan"
                          + tagPrefixList = [
                              + "v",
                            ]
                          + tagStatus     = "tagged"
                        }
                    },
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Delete untagged images older than 1 day"
                      + rulePriority = 2
                      + selection    = {
                          + countNumber = 1
                          + countType   = "sinceImagePushed"
                          + countUnit   = "days"
                          + tagStatus   = "untagged"
                        }
                    },
                ]
            }
        )
      + registry_id = (known after apply)
      + repository  = "leafwheels-backend"
    }

  # module.ecr.aws_ecr_lifecycle_policy.frontend will be created
  + resource "aws_ecr_lifecycle_policy" "frontend" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Keep last 10 images"
                      + rulePriority = 1
                      + selection    = {
                          + countNumber   = 10
                          + countType     = "imageCountMoreThan"
                          + tagPrefixList = [
                              + "v",
                            ]
                          + tagStatus     = "tagged"
                        }
                    },
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Delete untagged images older than 1 day"
                      + rulePriority = 2
                      + selection    = {
                          + countNumber = 1
                          + countType   = "sinceImagePushed"
                          + countUnit   = "days"
                          + tagStatus   = "untagged"
                        }
                    },
                ]
            }
        )
      + registry_id = (known after apply)
      + repository  = "leafwheels-frontend"
    }

  # module.ecr.aws_ecr_repository.backend will be created
  + resource "aws_ecr_repository" "backend" {
      + arn                  = (known after apply)
      + force_delete         = true
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "leafwheels-backend"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags                 = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "leafwheels-backend-ecr"
          + "Project"     = "LeafWheels"
        }
      + tags_all             = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "leafwheels-backend-ecr"
          + "Project"     = "LeafWheels"
        }

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # module.ecr.aws_ecr_repository.frontend will be created
  + resource "aws_ecr_repository" "frontend" {
      + arn                  = (known after apply)
      + force_delete         = true
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "leafwheels-frontend"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags                 = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "leafwheels-frontend-ecr"
          + "Project"     = "LeafWheels"
        }
      + tags_all             = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "leafwheels-frontend-ecr"
          + "Project"     = "LeafWheels"
        }

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # module.ecr.aws_ecr_repository_policy.backend will be created
  + resource "aws_ecr_repository_policy" "backend" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "ecr:GetDownloadUrlForLayer",
                          + "ecr:BatchGetImage",
                          + "ecr:BatchCheckLayerAvailability",
                          + "ecr:GetAuthorizationToken",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::635106762936:root"
                        }
                      + Sid       = "AllowPull"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + registry_id = (known after apply)
      + repository  = "leafwheels-backend"
    }

  # module.ecr.aws_ecr_repository_policy.frontend will be created
  + resource "aws_ecr_repository_policy" "frontend" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "ecr:GetDownloadUrlForLayer",
                          + "ecr:BatchGetImage",
                          + "ecr:BatchCheckLayerAvailability",
                          + "ecr:GetAuthorizationToken",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::635106762936:root"
                        }
                      + Sid       = "AllowPull"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + registry_id = (known after apply)
      + repository  = "leafwheels-frontend"
    }

  # module.ecs.aws_cloudwatch_log_group.backend will be created
  + resource "aws_cloudwatch_log_group" "backend" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/ecs/leafwheels-backend"
      + name_prefix       = (known after apply)
      + retention_in_days = 7
      + skip_destroy      = false
      + tags              = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "leafwheels-backend-logs"
          + "Project"     = "LeafWheels"
        }
      + tags_all          = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "leafwheels-backend-logs"
          + "Project"     = "LeafWheels"
        }
    }

  # module.ecs.aws_cloudwatch_log_group.cluster will be created
  + resource "aws_cloudwatch_log_group" "cluster" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/ecs/leafwheels-cluster"
      + name_prefix       = (known after apply)
      + retention_in_days = 7
      + skip_destroy      = false
      + tags              = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "leafwheels-cluster-logs"
          + "Project"     = "LeafWheels"
        }
      + tags_all          = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "leafwheels-cluster-logs"
          + "Project"     = "LeafWheels"
        }
    }

  # module.ecs.aws_cloudwatch_log_group.frontend will be created
  + resource "aws_cloudwatch_log_group" "frontend" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/ecs/leafwheels-frontend"
      + name_prefix       = (known after apply)
      + retention_in_days = 7
      + skip_destroy      = false
      + tags              = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "leafwheels-frontend-logs"
          + "Project"     = "LeafWheels"
        }
      + tags_all          = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "leafwheels-frontend-logs"
          + "Project"     = "LeafWheels"
        }
    }

  # module.ecs.aws_cloudwatch_log_group.grafana will be created
  + resource "aws_cloudwatch_log_group" "grafana" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/ecs/leafwheels-grafana"
      + name_prefix       = (known after apply)
      + retention_in_days = 7
      + skip_destroy      = false
      + tags              = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "leafwheels-grafana-logs"
          + "Project"     = "LeafWheels"
        }
      + tags_all          = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "leafwheels-grafana-logs"
          + "Project"     = "LeafWheels"
        }
    }

  # module.ecs.aws_cloudwatch_log_group.postgres will be created
  + resource "aws_cloudwatch_log_group" "postgres" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/ecs/leafwheels-postgres"
      + name_prefix       = (known after apply)
      + retention_in_days = 7
      + skip_destroy      = false
      + tags              = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "leafwheels-postgres-logs"
          + "Project"     = "LeafWheels"
        }
      + tags_all          = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "leafwheels-postgres-logs"
          + "Project"     = "LeafWheels"
        }
    }

  # module.ecs.aws_cloudwatch_log_group.prometheus will be created
  + resource "aws_cloudwatch_log_group" "prometheus" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/ecs/leafwheels-prometheus"
      + name_prefix       = (known after apply)
      + retention_in_days = 7
      + skip_destroy      = false
      + tags              = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "leafwheels-prometheus-logs"
          + "Project"     = "LeafWheels"
        }
      + tags_all          = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "leafwheels-prometheus-logs"
          + "Project"     = "LeafWheels"
        }
    }

  # module.ecs.aws_cloudwatch_log_group.redis will be created
  + resource "aws_cloudwatch_log_group" "redis" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/ecs/leafwheels-redis"
      + name_prefix       = (known after apply)
      + retention_in_days = 7
      + skip_destroy      = false
      + tags              = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "leafwheels-redis-logs"
          + "Project"     = "LeafWheels"
        }
      + tags_all          = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "leafwheels-redis-logs"
          + "Project"     = "LeafWheels"
        }
    }

  # module.ecs.aws_ecs_cluster.main will be created
  + resource "aws_ecs_cluster" "main" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + name     = "leafwheels-cluster"
      + tags     = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "leafwheels-cluster"
          + "Project"     = "LeafWheels"
        }
      + tags_all = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "leafwheels-cluster"
          + "Project"     = "LeafWheels"
        }

      + setting {
          + name  = "containerInsights"
          + value = "enabled"
        }
    }

  # module.ecs.aws_ecs_service.backend will be created
  + resource "aws_ecs_service" "backend" {
      + availability_zone_rebalancing      = "DISABLED"
      + cluster                            = (known after apply)
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 50
      + desired_count                      = 2
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "leafwheels-backend"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags                               = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "leafwheels-backend-service"
          + "Project"     = "LeafWheels"
        }
      + tags_all                           = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "leafwheels-backend-service"
          + "Project"     = "LeafWheels"
        }
      + task_definition                    = (known after apply)
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + load_balancer {
          + container_name   = "backend"
          + container_port   = 8080
          + target_group_arn = (known after apply)
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = (known after apply)
          + subnets          = (known after apply)
        }
    }

  # module.ecs.aws_ecs_service.frontend will be created
  + resource "aws_ecs_service" "frontend" {
      + availability_zone_rebalancing      = "DISABLED"
      + cluster                            = (known after apply)
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 50
      + desired_count                      = 2
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "leafwheels-frontend"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags                               = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "leafwheels-frontend-service"
          + "Project"     = "LeafWheels"
        }
      + tags_all                           = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "leafwheels-frontend-service"
          + "Project"     = "LeafWheels"
        }
      + task_definition                    = (known after apply)
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + load_balancer {
          + container_name   = "frontend"
          + container_port   = 3000
          + target_group_arn = (known after apply)
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = (known after apply)
          + subnets          = (known after apply)
        }
    }

  # module.ecs.aws_ecs_service.grafana will be created
  + resource "aws_ecs_service" "grafana" {
      + availability_zone_rebalancing      = "DISABLED"
      + cluster                            = (known after apply)
      + deployment_maximum_percent         = 100
      + deployment_minimum_healthy_percent = 0
      + desired_count                      = 1
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "leafwheels-grafana"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags                               = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "leafwheels-grafana-service"
          + "Project"     = "LeafWheels"
        }
      + tags_all                           = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "leafwheels-grafana-service"
          + "Project"     = "LeafWheels"
        }
      + task_definition                    = (known after apply)
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + load_balancer {
          + container_name   = "grafana"
          + container_port   = 3000
          + target_group_arn = (known after apply)
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = (known after apply)
          + subnets          = (known after apply)
        }

      + service_registries {
          + container_name = "grafana"
          + registry_arn   = (known after apply)
        }
    }

  # module.ecs.aws_ecs_service.postgres will be created
  + resource "aws_ecs_service" "postgres" {
      + availability_zone_rebalancing      = "DISABLED"
      + cluster                            = (known after apply)
      + deployment_maximum_percent         = 100
      + deployment_minimum_healthy_percent = 0
      + desired_count                      = 1
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "leafwheels-postgres"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags                               = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "leafwheels-postgres-service"
          + "Project"     = "LeafWheels"
        }
      + tags_all                           = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "leafwheels-postgres-service"
          + "Project"     = "LeafWheels"
        }
      + task_definition                    = (known after apply)
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = (known after apply)
          + subnets          = (known after apply)
        }

      + service_registries {
          + container_name = "postgres"
          + registry_arn   = (known after apply)
        }
    }

  # module.ecs.aws_ecs_service.prometheus will be created
  + resource "aws_ecs_service" "prometheus" {
      + availability_zone_rebalancing      = "DISABLED"
      + cluster                            = (known after apply)
      + deployment_maximum_percent         = 100
      + deployment_minimum_healthy_percent = 0
      + desired_count                      = 1
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "leafwheels-prometheus"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags                               = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "leafwheels-prometheus-service"
          + "Project"     = "LeafWheels"
        }
      + tags_all                           = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "leafwheels-prometheus-service"
          + "Project"     = "LeafWheels"
        }
      + task_definition                    = (known after apply)
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + load_balancer {
          + container_name   = "prometheus"
          + container_port   = 9090
          + target_group_arn = (known after apply)
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = (known after apply)
          + subnets          = (known after apply)
        }

      + service_registries {
          + container_name = "prometheus"
          + registry_arn   = (known after apply)
        }
    }

  # module.ecs.aws_ecs_service.redis will be created
  + resource "aws_ecs_service" "redis" {
      + availability_zone_rebalancing      = "DISABLED"
      + cluster                            = (known after apply)
      + deployment_maximum_percent         = 100
      + deployment_minimum_healthy_percent = 0
      + desired_count                      = 1
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "leafwheels-redis"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags                               = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "leafwheels-redis-service"
          + "Project"     = "LeafWheels"
        }
      + tags_all                           = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "leafwheels-redis-service"
          + "Project"     = "LeafWheels"
        }
      + task_definition                    = (known after apply)
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = (known after apply)
          + subnets          = (known after apply)
        }

      + service_registries {
          + container_name = "redis"
          + registry_arn   = (known after apply)
        }
    }

  # module.ecs.aws_ecs_task_definition.backend will be created
  + resource "aws_ecs_task_definition" "backend" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = (sensitive)
      + cpu                      = "512"
      + enable_fault_injection   = (known after apply)
      + execution_role_arn       = (known after apply)
      + family                   = "leafwheels-backend"
      + id                       = (known after apply)
      + memory                   = "1024"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags                     = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "leafwheels-backend-task"
          + "Project"     = "LeafWheels"
        }
      + tags_all                 = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "leafwheels-backend-task"
          + "Project"     = "LeafWheels"
        }
      + task_role_arn            = (known after apply)
      + track_latest             = false
    }

  # module.ecs.aws_ecs_task_definition.frontend will be created
  + resource "aws_ecs_task_definition" "frontend" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = (known after apply)
      + cpu                      = "256"
      + enable_fault_injection   = (known after apply)
      + execution_role_arn       = (known after apply)
      + family                   = "leafwheels-frontend"
      + id                       = (known after apply)
      + memory                   = "512"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags                     = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "leafwheels-frontend-task"
          + "Project"     = "LeafWheels"
        }
      + tags_all                 = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "leafwheels-frontend-task"
          + "Project"     = "LeafWheels"
        }
      + task_role_arn            = (known after apply)
      + track_latest             = false
    }

  # module.ecs.aws_ecs_task_definition.grafana will be created
  + resource "aws_ecs_task_definition" "grafana" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = jsonencode(
            [
              + {
                  + environment      = [
                      + {
                          + name  = "GF_SECURITY_ADMIN_PASSWORD"
                          + value = "admin"
                        },
                      + {
                          + name  = "GF_SECURITY_ADMIN_USER"
                          + value = "admin"
                        },
                      + {
                          + name  = "GF_SERVER_ROOT_URL"
                          + value = "%(protocol)s://%(domain)s:%(http_port)s/grafana/"
                        },
                      + {
                          + name  = "GF_SERVER_SERVE_FROM_SUB_PATH"
                          + value = "true"
                        },
                      + {
                          + name  = "GF_USERS_ALLOW_SIGN_UP"
                          + value = "false"
                        },
                    ]
                  + essential        = true
                  + healthCheck      = {
                      + command     = [
                          + "CMD-SHELL",
                          + "curl -f http://localhost:3000/api/health || exit 1",
                        ]
                      + interval    = 30
                      + retries     = 3
                      + startPeriod = 60
                      + timeout     = 5
                    }
                  + image            = "grafana/grafana:latest"
                  + logConfiguration = {
                      + logDriver = "awslogs"
                      + options   = {
                          + awslogs-group         = "/ecs/leafwheels-grafana"
                          + awslogs-region        = "us-east-1"
                          + awslogs-stream-prefix = "ecs"
                        }
                    }
                  + memory           = 512
                  + mountPoints      = []
                  + name             = "grafana"
                  + portMappings     = [
                      + {
                          + containerPort = 3000
                          + protocol      = "tcp"
                        },
                    ]
                },
            ]
        )
      + cpu                      = "512"
      + enable_fault_injection   = (known after apply)
      + execution_role_arn       = (known after apply)
      + family                   = "leafwheels-grafana"
      + id                       = (known after apply)
      + memory                   = "1024"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags                     = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "leafwheels-grafana-task"
          + "Project"     = "LeafWheels"
        }
      + tags_all                 = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "leafwheels-grafana-task"
          + "Project"     = "LeafWheels"
        }
      + task_role_arn            = (known after apply)
      + track_latest             = false
    }

  # module.ecs.aws_ecs_task_definition.postgres will be created
  + resource "aws_ecs_task_definition" "postgres" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = (sensitive)
      + cpu                      = "512"
      + enable_fault_injection   = (known after apply)
      + execution_role_arn       = (known after apply)
      + family                   = "leafwheels-postgres"
      + id                       = (known after apply)
      + memory                   = "1024"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags                     = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "leafwheels-postgres-task"
          + "Project"     = "LeafWheels"
        }
      + tags_all                 = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "leafwheels-postgres-task"
          + "Project"     = "LeafWheels"
        }
      + task_role_arn            = (known after apply)
      + track_latest             = false

      + volume {
          + configure_at_launch = (known after apply)
          + name                = "postgres-data"

          + efs_volume_configuration {
              + file_system_id          = (known after apply)
              + root_directory          = "/"
              + transit_encryption      = "ENABLED"
              + transit_encryption_port = 0
            }
        }
    }

  # module.ecs.aws_ecs_task_definition.prometheus will be created
  + resource "aws_ecs_task_definition" "prometheus" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = jsonencode(
            [
              + {
                  + command          = [
                      + "echo $PROMETHEUS_CONFIG_CONTENT | base64 -d > /tmp/prometheus.yml && prometheus --config.file=/tmp/prometheus.yml --storage.tsdb.path=/prometheus --web.console.libraries=/etc/prometheus/console_libraries --web.console.templates=/etc/prometheus/consoles --storage.tsdb.retention.time=200h --web.enable-lifecycle --web.external-url=/prometheus",
                    ]
                  + entryPoint       = [
                      + "sh",
                      + "-c",
                    ]
                  + environment      = [
                      + {
                          + name  = "PROMETHEUS_CONFIG_CONTENT"
                          + value = "Z2xvYmFsOgogIHNjcmFwZV9pbnRlcnZhbDogMTVzCiAgZXZhbHVhdGlvbl9pbnRlcnZhbDogMTVzCgpydWxlX2ZpbGVzOgogICMgLSAiZmlyc3RfcnVsZXMueW1sIgogICMgLSAic2Vjb25kX3J1bGVzLnltbCIKCnNjcmFwZV9jb25maWdzOgogIC0gam9iX25hbWU6ICdwcm9tZXRoZXVzJwogICAgbWV0cmljc19wYXRoOiAnL3Byb21ldGhldXMvbWV0cmljcycKICAgIHN0YXRpY19jb25maWdzOgogICAgICAtIHRhcmdldHM6IFsnbG9jYWxob3N0OjkwOTAnXQoKICAtIGpvYl9uYW1lOiAnbGVhZndoZWVscy1iYWNrZW5kJwogICAgbWV0cmljc19wYXRoOiAnL2FjdHVhdG9yL3Byb21ldGhldXMnCiAgICBzdGF0aWNfY29uZmlnczoKICAgICAgLSB0YXJnZXRzOiBbJ2xlYWZ3aGVlbHMtYWxiLTEyMDUwMTYxMjgudXMtZWFzdC0xLmVsYi5hbWF6b25hd3MuY29tOjgwJ10KICAgIHBhcmFtczoKICAgICAgX19zY2hlbWVfXzogWydodHRwJ10KICAgIHNjcmFwZV9pbnRlcnZhbDogNXMKICAgIHNjcmFwZV90aW1lb3V0OiA1cwoKICAjIFBvc3RncmVTUUwgbWV0cmljcyB2aWEgcG9zdGdyZXNfZXhwb3J0ZXIgKGlmIG5lZWRlZCkKICAjIC0gam9iX25hbWU6ICdwb3N0Z3JlcycKICAjICAgc3RhdGljX2NvbmZpZ3M6CiAgIyAgICAgLSB0YXJnZXRzOiBbJ3Bvc3RncmVzLmxlYWZ3aGVlbHMubG9jYWw6OTE4NyddCgogICMgUmVkaXMgbWV0cmljcyB2aWEgcmVkaXNfZXhwb3J0ZXIgKGlmIG5lZWRlZCkgIAogICMgLSBqb2JfbmFtZTogJ3JlZGlzJwogICMgICBzdGF0aWNfY29uZmlnczoKICAjICAgICAtIHRhcmdldHM6IFsncmVkaXMubGVhZndoZWVscy5sb2NhbDo5MTIxJ10="
                        },
                    ]
                  + essential        = true
                  + healthCheck      = {
                      + command     = [
                          + "CMD-SHELL",
                          + "wget --no-verbose --tries=1 --spider http://localhost:9090/prometheus/-/healthy || exit 1",
                        ]
                      + interval    = 30
                      + retries     = 3
                      + startPeriod = 30
                      + timeout     = 5
                    }
                  + image            = "prom/prometheus:latest"
                  + logConfiguration = {
                      + logDriver = "awslogs"
                      + options   = {
                          + awslogs-group         = "/ecs/leafwheels-prometheus"
                          + awslogs-region        = "us-east-1"
                          + awslogs-stream-prefix = "ecs"
                        }
                    }
                  + memory           = 512
                  + mountPoints      = []
                  + name             = "prometheus"
                  + portMappings     = [
                      + {
                          + containerPort = 9090
                          + protocol      = "tcp"
                        },
                    ]
                },
            ]
        )
      + cpu                      = "512"
      + enable_fault_injection   = (known after apply)
      + execution_role_arn       = (known after apply)
      + family                   = "le
      ```
      
      </details>